tests/artillery/scenarios/product-list.yml
config:
  target: '{{ $processEnvironment.TARGET_URL }}'
  phases:
    - duration: 30
      arrivalRate: 20
      name: 'Warm up'
    - duration: 60
      arrivalRate: 50
      name: 'Sustained load'

  defaults:
    headers:
      Content-Type: 'application/json'

  ensure:
    p95: 500
    p99: 1000
    maxErrorRate: 1

scenarios:
  - name: 'Product List'
    weight: 3
    flow:
      - get:
          url: '/api/products'
          qs:
            page: 1
            limit: 20
          expect:
            - statusCode: 200

  - name: 'Product List with Filter'
    weight: 1
    flow:
      - get:
          url: '/api/products'
          qs:
            page: 1
            limit: 20
            search: '셔츠'
            minPrice: 10000
            maxPrice: 100000
          expect:
            - statusCode: 200