tests/artillery/scenarios/refresh-token.yml
config:
  target: 'http://localhost:3001'
  http:
    cookieJar: true
  phases:
    - duration: 30
      arrivalRate: 5
      name: 'Warm up'
    - duration: 60
      arrivalRate: 15
      name: 'Sustained load'

  defaults:
    headers:
      Content-Type: 'application/json'

  payload:
    path: '../data/buyers.csv'
    fields:
      - 'email'
      - 'password'
    skipHeader: true

  ensure:
    p95: 800
    p99: 1500
    maxErrorRate: 1

before:
  flow:
    - post:
        url: '/api/auth/login'
        json:
          email: '{{ email }}'
          password: '{{ password }}'
        capture:
          - json: '$.accessToken'
            as: 'accessToken'
          - header: 'set-cookie'
            as: 'cookies'

scenarios:
  - name: 'Refresh Token'
    flow:
      - post:
          url: '/api/auth/refresh'
          headers:
            Cookie: '{{ cookies }}'
          expect:
            - statusCode: 200
            - hasProperty: 'accessToken'